  #'a':5,'f':10 #то что пришется в принте в кавычках это для красоты, программа работает без них   # ['a'],['f']
# A = {'f': 10, 'a': 2, 'c':17 }
# ak = A.keys()
# list_ak = list(ak)
#
#
# B = {}
# for k in list_ak :
#     print('(', k, ':',A[k],')')
#     B[k]=A[k]
#     print(B)

    #Задание 1
#Создайте словарь person, в котором будут присутствовать ключи name, age,city
#Выведите значение возраста из словаря person

d = {'name':1,'age':2,'city':3}
print(d['age'])

    #Задание 2
# bmw= {'x3':1,'x5':2,'x6':3}
# tesla = {'model1':1,'model2':2,'model3':3}
#
# car = {'bmw':['x3','x5','x6'],
#        'tesla':['model1','model2','model3']}
# print(car["tesla"][0],car["tasla"][2])
# print(car["bmw"][0],car["bmw"][2])

#Задание 3
d1 = {"a": 100, "b": 200, "c":300}
d2 = {'a': 300, 'b': 200, 'd':400}
print(d1["b"] == d2["b"])

#Задание4
a = {'data1':375, 'data2':567, 'data3':37, 'data':21}
result = 1
for key in a:
    result =
